In [1]:
import pandas as pd
import numpy as np

In [6]:
filename = "data.csv"
df = pd.read_csv(filename, sep=";")

In [7]:
df

  voornaam achternaam woonplaats  leeftijd
0   Albert   Einstein     Leiden        64
1     Tijn     Peters  Amsterdam        26
2      Luc   Lucassen  Amsterdam        24
3     Joep    Joepsma    Utrecht        24

In [6]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.describe()

        leeftijd
count   4.000000
mean   34.500000
std    19.689253
min    24.000000
25%    24.000000
50%    25.000000
75%    35.500000
max    64.000000

In [7]:
df['achternaam']

0            Anema
1      Oostenbrink
2    van der Knaap
3           Peters
Name: achternaam, dtype: object

In [8]:
df[['voornaam','achternaam']]

  voornaam     achternaam
0    Peter          Anema
1     Tijn    Oostenbrink
2      Luc  van der Knaap
3     Joep         Peters

In [9]:
df[['achternaam', 'voornaam']]

      achternaam voornaam
0          Anema    Peter
1    Oostenbrink     Tijn
2  van der Knaap      Luc
3         Peters     Joep

In [12]:
df['volledige_naam'] = df['voornaam'] + ' ' + df['achternaam']

In [13]:
df

  voornaam     achternaam woonplaats  leeftijd     volledige_naam
0    Peter          Anema       Lhee        64        Peter Anema
1     Tijn    Oostenbrink  Amsterdam        26   Tijn Oostenbrink
2      Luc  van der Knaap  Amsterdam        24  Luc van der Knaap
3     Joep         Peters    Utrecht        24        Joep Peters

In [18]:
df['woonplaats'] == 'Amsterdam'

0    False
1     True
2     True
3    False
Name: woonplaats, dtype: bool

In [20]:
df[df['woonplaats'] == 'Utrecht']

  voornaam achternaam woonplaats  leeftijd volledige_naam
3     Joep     Peters    Utrecht        24    Joep Peters

In [23]:
df.sort_values('achternaam')

  voornaam     achternaam woonplaats  leeftijd     volledige_naam
2      Luc  van der Knaap  Amsterdam        24  Luc van der Knaap
3     Joep         Peters    Utrecht        24        Joep Peters
1     Tijn    Oostenbrink  Amsterdam        26   Tijn Oostenbrink
0    Peter          Anema       Lhee        64        Peter Anema

In [24]:
df.sort_values('achternaam', ascending=False)

  voornaam     achternaam woonplaats  leeftijd     volledige_naam
2      Luc  van der Knaap  Amsterdam        24  Luc van der Knaap
3     Joep         Peters    Utrecht        24        Joep Peters
1     Tijn    Oostenbrink  Amsterdam        26   Tijn Oostenbrink
0    Peter          Anema       Lhee        64        Peter Anema

In [32]:
s = pd.Series([4,4,6,7,8,2,4,4.5,'x'])

In [33]:
s

0      4
1      4
2      6
3      7
4      8
5      2
6      4
7    4.5
8      x
dtype: object

In [39]:
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140, 'Apr': 300},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df = pd.DataFrame(sales)

In [40]:
df

     account  Jan  Feb  Mar    Apr
0  Jones LLC  150  200  140  300.0
1   Alpha Co  200  210  215    NaN
2   Blue Inc   50   90   95    NaN

In [41]:
df.dtypes

account     object
Jan          int64
Feb          int64
Mar          int64
Apr        float64
dtype: object

In [42]:
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
sales

{'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
 'Jan': [150, 200, 50],
 'Feb': [200, 210, 90],
 'Mar': [140, 215, 95]}

In [44]:
df = pd.DataFrame.from_dict(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [45]:
sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95